package muhammad.fourty.saying.util

object Saying {

    const val first = "اخلاص نیت *\n" +
            "’’ سارے عمل نیت سے ہیں‘‘\n" +
            "رسول اکرم ﷺ نے ارشادفرمایا:\n" +
            "( بخاری ومسلم )\n" +
            "Hadees.No. 1\n" +
            "تشریح :\n" +
            "یعنی اعمال اچھی نیت سے اچھے اور بری نیت سے برے ہو جاتے ہیں ۔ جن کاموں سے شریعت نے\n" +
            "روک دیا ہے ان کو تو کسی بھی نیت سے کیا جاۓ وہ غلط اور ممنوع ہی رہیں گے البتہ جن کاموں کے کرنے میں\n" +
            "مسلمانوں پر کوئی ممانعت نہیں ہے یا جن کا موں کے کرنے کا باقاعدہ حکم دیا گیا ہے ان میں اگر نیت خدا تعالی کو\n" +
            "راضی کرنے کی ہوگی تو اس اچھی نیت سے وہ کام اچھا ہو جاۓ گا اور اگر اس کام کے کرنے میں لوگوں کو\n" +
            "دکھا نا، اپنی نیکی جتلا نا پیش نظر ہوگا تو اس نمائش اور ریکاری کی وجہ سے بیل برا ہو جاۓ گا۔\n" +
            "مثلا ایک شخص اپنی\n" +
            "نماز اس لئے خوب لبی پڑھتا ہے کہ دیکھنے والے اسے نیک اور بزرگ سمجھیں تو اسکی می نماز اس ریا کاری کی وجہ\n" +
            "سے بری ہو جاۓ گی اور بجاۓ ثواب کے عذاب کا سبب ہو جاۓ گی اور اگر اللہ تعالی کو خوش کرنے کی لئے\n" +
            "پڑھتا ہے تو اس کو ثواب ملے گا ۔ اسی طرح کوئی شخص خوشبو اس لئے لگا تا ہے کہ اس کے پاس بیٹھنے والوں کو اس\n" +
            "کے لپیٹے وغیرہ کی بو سے تکلیف نہ ہوتو اس کی اچھی نیت سے یہ خوشبو لگانے کا عمل اچھا ہو جاۓ گا اور اس پر ثواب\n" +
            "بھی ملے گا اور اگر خوشبو کا ہی استعمال محض اپنی مالداری او را میری دکھلانے کے لئے ہوتو آخرت کے لحاظ سے یہ\n" +
            "عمل اس کے لئے برا ہو گا اور اس نمائش کی سزا بھگتنی پڑے گی ۔\n" +
            "حاصل اس حدیث شریف کا یہ ہے کہ ہر\n" +
            "مسلمان کو اپنا عمل خدا تعالی کی خوشنودی اور اسکی رضا مندی کے لئے کرنا چاہئے ۔لوگوں کو دکھانے اور ان کے\n" +
            "سامنے جتانے سے بچانا چاہئے ۔ اللہ تعالی کے ہاں انسانی عمل کی قد روار نی اس کے اخلاص کی وجہ سے ہوگی\n" +
            "جس کام میں جتنا اخلاص ہوگا اتنا ہی وہ اللہ تعالی کے ہاں مقبول ہوگا ۔"

    const val second = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n" +
            "Hadees.No.2\n\n  \n  صلى الله عليه وسلم  " +
            "یہ حدیث مسلمانوں کے باہمی حقوق کے بارے میں بلکل واضح ہے۔ البتہ مذکورہ حقوق میں چند باتوں کیطرف توجہ ضروری ہے\n" +
            "(1) سلام کا جواب دینے میں بعض جگہ رسمی طور پر ہاتھ ملالیتے ہیں یا دعائیں دیتے ہیں مگر ”وعلیکم اسلام کا لفظ نہیں کہتے حالانکہ یہ ضروری ہے، سلام کا جواب دینا محمد صلى الله عليه وسلم  واجب ہے ” جیتے رہو\" لمبی عمر پاؤ کہنے سے یہ واجب ادا نہیں ہوتا ۔\n" +
            "(۲) مریض کی مزاج پرسی میں اسکا خیال رہنا چاہئے کہ ایسے وقت میں عیادت کیلئے جائیں جب اس کو ملاقات کرنے میں کوئی تکلیف نہ ہو۔ اور اتنی دیر اس کے پاس نہ بیٹھے کہ وہ اکتا جائے، یا اپنی کسی ضرورت میں تنگی محسوس کرے۔ مثلاً لبعض اوقات کوئی بیما در امریض پر اسطرح مسلط ہو جاتا ہے کہ اگر وہ سونا چاہے تو سو نہیں سکتا یا خاموش رہنا چا ہتا ہے تو لحاظ کی وجہ سے نہیں رہ سکتا۔\n" +
            "(۳) جنازے کے ساتھ جانے میں بھی اس کا خیال رہے کہ کوئی کام خلاف سنت نہ ہو۔ آج کل جنازے میں بہت سی چیزیں اپنی طرف سے بڑھائی گئی ہیں، ان سے بچنے اور کسی مناسب موقع پر دوسروں کو بھی ان رسومات و بدعات سے منع کرے۔\n" +
            "(۴) حضرت محمد صلى الله عليه وسلم  دعوت قبول کرنے میں بھی یہ شرط ہے کہ وہاں جا کر کسی ناجائز کام میں شرکت نہ ہو جیسے آجکل ولیمہ وغیرہ کی دعوتیں، بے پردگی ، غیر محرم مردو عورت کے آزادانہ اختلاط اور فلم سازی اور تصویر بازی سے بھری ہوئی ہوتی  ہیں ایسی دعوتوں کا قبول کرنا جائز نہیں۔ \n" +
            "(۵) چھنے والا جب \" الحمد للہ کہے تو اس وقت اسکو یہ کہہ کر دعا دینی چاہئے یرحمک اللہ اللہ تم پر رحمت کرے۔ البتہ کچھ لوگ دینی یاد نیاوی کاموں میں مشغول ہیں تو وہاں چھنکنے والے کیلئے بہتر یہ ہے کہ وہ الحمد للہ زیرلب کہے تا کہ سننے والوں پر یہ دعائیہ کلمہ کہنا لازم نہ ہو۔\n"


    const val third = "حضوراکرم ﷺ نے ارشادفرمایا:\n" +
            "(۳)\n" +
            "33\n" +
            "رحمدلی **\n" +
            "” اللہ تعالی اس شخص پر رحم نہیں کر تا جولوگوں پر رحم نہیں کرتا‘‘\n" +
            "( بخاری ومسلم )\n" +
            "Hadees.No.3\n" +
            "تشریح :\n" +
            "رحمت دراصل اللہ تعالی کی صفت ہے جس انسان میں دوسروں کے لئے رحمہ لی ہو گی اتنا ہی وہ اللہ تعالی\n" +
            "کی رحمت کا مستحق ہوگا ۔ دوسری روایت میں یہ بھی ہے کہ بد بخت انسان ہی رحم سے خالی ہوتا ہے اور ایک\n" +
            "روایت میں آ تا ہے کہ لوگو! تم دنیا والوں پر رحم کرو اللہ تعالی تم پر رحم فرمائیں گے ۔\n" +
            "چناچہ ضعیف اور کمزور آدمی پر\n" +
            "رحم کر نا چاہئے ۔مسکینوں اور یتیموں کے سر پر ہاتھ رکھنا چاہئے ۔محتاج اور بیواوں کی خبر گیری رکھنی چاہئے کوئی\n" +
            "عزیز رشتہ دار یا پڑوی پیار ہو تو اس کے علاج و دوا کی فکر رکھنی چاہئے اور جسمانی بیماریوں کی روک تھام میں مدد\n" +
            "کرنے کے ساتھ ساتھ روحانی بیماریوں سے بچانا اور اسکی درستگی کا اہتمام رکھنا بھی رحمدلی میں شامل ہے اسلئے\n" +
            "کہ ایمان اور اچھے اعمال واخلاق پیدا ہونے سے ہرانسان آخرت کی تکلیف اور عذاب سے بچ سکتا ہے ۔لہذا\n" +
            "اس کی فکر کر نا بھی ایک دوسرے پر ترس کھا نا اور رحم کرنا ہے اسی طرح ہمارے ذاتی معاملات میں کسی سے کوئی\n" +
            "غلطی یا حق تلفی ہو جاۓ تو اسے معاف کر دینا چاہئے ۔"


    const val forth = "مسلمانوں کے چند حقوق جوحضوراکرم ﷺ نے فرمایا:\n" +
            "(۴)\n" +
            "چغل خوری *\n" +
            "چغل خور جنت میں نہ جاۓ گا‘‘ ۔\n" +
            "( بخاری ومسلم )\n" +
            "Hadees.No.4\n" +
            "تشریح :\n" +
            "قرآن وحدیث کی باہمی تعلیمات میں ، باہمی محبت اور خوشگواری کو بہت اہمیت دی گئی ہے ، اور ہرای\n" +
            "چیز سے روکا گیا ہے ، جو باہمی تعلقات کو بگاڑ دے اور آپس میں نفرتیں پیدا کر دے، ایسی ہی نفرت پیدا کر نے\n" +
            "والی چیز چغل خوری ہے ۔ یعنی کے ایک شخص کی ایسی بات دوسرے تک پہنچا نا جسکوسن کر یہ سننے والا اس شخص\n" +
            "سے بدگمان ہو جاۓ اور دونوں میں رنجش اور ناراضگی ہو جاۓ اور باہمی تعلقات میں خرابی آۓ ، اس چیز کا\n" +
            "نام چغلخوری ہے اور حدیث شریف میں ایسے شخص کے لئے سخت وعید ہے کہ وہ جنت میں داخل نہ ہوگا ، جس کا\n" +
            "مقصد یہی ہے کہ ہم ایک دوسرے کی چغلخوری نہ کر میں\n" +
            "دفتر وغیرہ میں افسران بالا کو خوش کرنے کیلئے دوسرے کی شکائتیں کر دینا یا عام گھر یلو حالات\n" +
            "میں کسی پر اپنی محبت جتانے کیلئے دوسرے کیطرف سے نفرت بٹھا نا بھی چھلخوری کے قریب ہے اس لئے اس\n" +
            "رویے سے بچنے کی بہت شدید ضرورت ہے ورنہ آخرت کا عذاب اور جنت سے محرومی تو ہے ہی دنیاوی طور پر\n" +
            "بھی ایسا شخص خوش نہیں دیکھا گیا اور دوسروں کو برا ثابت کر نے والا چند دنوں میں خد ہی برا بن جا تا ہے ۔ گو یا\n" +
            "جو گڑ ھا دوسروں کیلئے کھودتا ہے ، اس میں خود ہی گر پڑتا ہے اللہ تعالی ہم سب کو محفوظ رکھے۔"

    const val fifth = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"


    const val sixth = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"

    const val seventh = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"

    const val eight = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"

    const val nine = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"

    const val tenth = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"

    const val eleventh = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"

    const val twelve = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"

    const val thirteen = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"

    const val fourteen = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"


    const val fifteen  = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"

    const val sixteen = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"

    const val seventeen = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"

    const val eighteen = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"

    const val nineteen = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"

    const val twenty = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"

    const val twentyOne = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"

    const val twentyTwo = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"

    const val twentyThree = "مسلمانوں کے چند حقوق جو\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض\n" +
            "کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ\n" +
            "کہہ کر دینا\n" +
            "( بخاری ومسلم)\n" +
            "تشریح\n"


}