package muhammad.fourty.saying.util

object Saying {

    const val first = "\n Hadees.No.1\n\n" +
            "رسول اکرم ﷺ نے ارشادفرمایا:\n" +
            "quote\"سارے عمل نیت سے ہیں“quote\n" +
            "( بخاری ومسلم )\n\n" +

            " یعنی اعمال اچھی نیت سے اچھے اور بری نیت سے برے ہو جاتے ہیں ۔ جن کاموں سے شریعت نے " +
            " روک دیا ہے ان کو تو کسی بھی نیت سے کیا جاۓ وہ غلط اور ممنوع ہی رہیں گے البتہ جن کاموں کے کرنے میں" +
            "مسلمانوں پر کوئی ممانعت نہیں ہے یا جن کا موں کے کرنے کا باقاعدہ حکم دیا گیا ہے ان میں اگر نیت خدا تعالی کو" +
            " راضی کرنے کی ہوگی تو اس اچھی نیت سے وہ کام اچھا ہو جاۓ گا اور اگر اس کام کے کرنے میں لوگوں کو  " +
            "دکھا نا، اپنی نیکی جتلا نا پیش نظر ہوگا تو اس نمائش اور ریکاری کی وجہ سے بیل برا ہو جاۓ گا۔" +
            "\n\n"+
            " مثلا ایک شخص اپنی" +
            " نماز اس لئے خوب لبی پڑھتا ہے کہ دیکھنے والے اسے نیک اور بزرگ سمجھیں تو اسکی می نماز اس ریا کاری کی وجہ " +
            " سے بری ہو جاۓ گی اور بجاۓ ثواب کے عذاب کا سبب ہو جاۓ گی اور اگر اللہ تعالی کو خوش کرنے کی لئے" +
            " پڑھتا ہے تو اس کو ثواب ملے گا ۔ اسی طرح کوئی شخص خوشبو اس لئے لگا تا ہے کہ اس کے پاس بیٹھنے والوں کو اس" +
            " کے لپیٹے وغیرہ کی بو سے تکلیف نہ ہوتو اس کی اچھی نیت سے یہ خوشبو لگانے کا عمل اچھا ہو جاۓ گا اور اس پر ثواب" +
            " بھی ملے گا اور اگر خوشبو کا ہی استعمال محض اپنی مالداری او را میری دکھلانے کے لئے ہوتو آخرت کے لحاظ سے یہ " +
            "عمل اس کے لئے برا ہو گا اور اس نمائش کی سزا بھگتنی پڑے گی ۔" +
            "\n\n"+
            "حاصل اس حدیث شریف کا یہ ہے کہ ہر" +
            "مسلمان کو اپنا عمل خدا تعالی کی خوشنودی اور اسکی رضا مندی کے لئے کرنا چاہئے ۔لوگوں کو دکھانے اور ان کے" +
            "سامنے جتانے سے بچانا چاہئے ۔ اللہ تعالی کے ہاں انسانی عمل کی قد روار نی اس کے اخلاص کی وجہ سے ہوگی" +
            "جس کام میں جتنا اخلاص ہوگا اتنا ہی وہ اللہ تعالی کے ہاں مقبول ہوگا ۔"

    const val second =  "\n" +"Hadees.No.2\n\n"+
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "quote مسلمان کے مسلمان پر پانچ حقوق ہیں (۱) سلام کا جواب دینا۔ (۲) مریض کی بیمار پرسی کرنا (۳) جنازے کے ساتھ جانا (۴) اسکی دعوت قبول کرنا (۵) اور چھینک کا جواب یرحمک اللہ کہہ کر دینا quote" +
            "\n( بخاری ومسلم)\n" +


            "یہ حدیث مسلمانوں کے باہمی حقوق کے بارے میں بلکل واضح ہے۔ البتہ مذکورہ حقوق میں چند باتوں کیطرف توجہ ضروری ہے\n" +
            "(1) سلام کا جواب دینے میں بعض جگہ رسمی طور پر ہاتھ ملالیتے ہیں یا دعائیں دیتے ہیں مگر ”وعلیکم اسلام کا لفظ نہیں کہتے حالانکہ یہ ضروری ہے، سلام کا جواب دینا محمد صلى الله عليه وسلم  واجب ہے ” جیتے رہو\" لمبی عمر پاؤ کہنے سے یہ واجب ادا نہیں ہوتا ۔\n" +
            "(۲) مریض کی مزاج پرسی میں اسکا خیال رہنا چاہئے کہ ایسے وقت میں عیادت کیلئے جائیں جب اس کو ملاقات کرنے میں کوئی تکلیف نہ ہو۔ اور اتنی دیر اس کے پاس نہ بیٹھے کہ وہ اکتا جائے، یا اپنی کسی ضرورت میں تنگی محسوس کرے۔ مثلاً لبعض اوقات کوئی بیما در امریض پر اسطرح مسلط ہو جاتا ہے کہ اگر وہ سونا چاہے تو سو نہیں سکتا یا خاموش رہنا چا ہتا ہے تو لحاظ کی وجہ سے نہیں رہ سکتا۔\n" +
            "(۳) جنازے کے ساتھ جانے میں بھی اس کا خیال رہے کہ کوئی کام خلاف سنت نہ ہو۔ آج کل جنازے میں بہت سی چیزیں اپنی طرف سے بڑھائی گئی ہیں، ان سے بچنے اور کسی مناسب موقع پر دوسروں کو بھی ان رسومات و بدعات سے منع کرے۔\n" +
            "(۴) حضرت محمد صلى الله عليه وسلم  دعوت قبول کرنے میں بھی یہ شرط ہے کہ وہاں جا کر کسی ناجائز کام میں شرکت نہ ہو جیسے آجکل ولیمہ وغیرہ کی دعوتیں، بے پردگی ، غیر محرم مردو عورت کے آزادانہ اختلاط اور فلم سازی اور تصویر بازی سے بھری ہوئی ہوتی  ہیں ایسی دعوتوں کا قبول کرنا جائز نہیں۔ \n" +
            "(۵) چھنے والا جب \" الحمد للہ کہے تو اس وقت اسکو یہ کہہ کر دعا دینی چاہئے یرحمک اللہ اللہ تم پر رحمت کرے۔ البتہ کچھ لوگ دینی یاد نیاوی کاموں میں مشغول ہیں تو وہاں چھنکنے والے کیلئے بہتر یہ ہے کہ وہ الحمد للہ زیرلب کہے تا کہ سننے والوں پر یہ دعائیہ کلمہ کہنا لازم نہ ہو۔\n"


    const val third =   "\n" +"Hadees.No.3\n\n" +
            "حضوراکرم ﷺ نے ارشادفرمایا:\n" +
            "quote”اللہ تعالی اس شخص پر رحم نہیں کر تا جولوگوں پر رحم نہیں کرتا“quote\n" +
            "( بخاری ومسلم )\n" +


            "رحمت دراصل اللہ تعالی کی صفت ہے جس انسان میں دوسروں کے لئے رحمہ لی ہو گی اتنا ہی وہ اللہ تعالی\n" +
            "کی رحمت کا مستحق ہوگا ۔ دوسری روایت میں یہ بھی ہے کہ بد بخت انسان ہی رحم سے خالی ہوتا ہے اور ایک" +
            "روایت میں آ تا ہے کہ لوگو! تم دنیا والوں پر رحم کرو اللہ تعالی تم پر رحم فرمائیں گے ۔" +
            "چناچہ ضعیف اور کمزور آدمی پر\n" +
            "رحم کر نا چاہئے ۔مسکینوں اور یتیموں کے سر پر ہاتھ رکھنا چاہئے ۔محتاج اور بیواوں کی خبر گیری رکھنی چاہئے کوئی" +
            "عزیز رشتہ دار یا پڑوی پیار ہو تو اس کے علاج و دوا کی فکر رکھنی چاہئے اور جسمانی بیماریوں کی روک تھام میں مدد" +
            "کرنے کے ساتھ ساتھ روحانی بیماریوں سے بچانا اور اسکی درستگی کا اہتمام رکھنا بھی رحمدلی میں شامل ہے اسلئے" +
            "کہ ایمان اور اچھے اعمال واخلاق پیدا ہونے سے ہرانسان آخرت کی تکلیف اور عذاب سے بچ سکتا ہے ۔لہذا" +
            "اس کی فکر کر نا بھی ایک دوسرے پر ترس کھا نا اور رحم کرنا ہے اسی طرح ہمارے ذاتی معاملات میں کسی سے کوئی" +
            "غلطی یا حق تلفی ہو جاۓ تو اسے معاف کر دینا چاہئے ۔"


    const val forth =   "\n" +"Hadees.No.4\n\n" +

            "quote\"چغل خور جنت میں نہ جاۓ گا“quote\n" +
            "( بخاری ومسلم )\n" +
            "\n"+
            "قرآن وحدیث کی باہمی تعلیمات میں ، باہمی محبت اور خوشگواری کو بہت اہمیت دی گئی ہے ، اور ہرای" +
            "چیز سے روکا گیا ہے ، جو باہمی تعلقات کو بگاڑ دے اور آپس میں نفرتیں پیدا کر دے، ایسی ہی نفرت پیدا کر نے\n" +
            "والی چیز چغل خوری ہے ۔ یعنی کے ایک شخص کی ایسی بات دوسرے تک پہنچا نا جسکوسن کر یہ سننے والا اس شخص\n" +
            "سے بدگمان ہو جاۓ اور دونوں میں رنجش اور ناراضگی ہو جاۓ اور باہمی تعلقات میں خرابی آۓ ، اس چیز کا\n" +
            "نام چغلخوری ہے اور حدیث شریف میں ایسے شخص کے لئے سخت وعید ہے کہ وہ جنت میں داخل نہ ہوگا ، جس کا\n" +
            "مقصد یہی ہے کہ ہم ایک دوسرے کی چغلخوری نہ کر میں\n" +
            "دفتر وغیرہ میں افسران بالا کو خوش کرنے کیلئے دوسرے کی شکائتیں کر دینا یا عام گھر یلو حالات\n" +
            "میں کسی پر اپنی محبت جتانے کیلئے دوسرے کیطرف سے نفرت بٹھا نا بھی چھلخوری کے قریب ہے اس لئے اس\n" +
            "رویے سے بچنے کی بہت شدید ضرورت ہے ورنہ آخرت کا عذاب اور جنت سے محرومی تو ہے ہی دنیاوی طور پر\n" +
            "بھی ایسا شخص خوش نہیں دیکھا گیا اور دوسروں کو برا ثابت کر نے والا چند دنوں میں خد ہی برا بن جا تا ہے ۔ گو یا\n" +
            "جو گڑ ھا دوسروں کیلئے کھودتا ہے ، اس میں خود ہی گر پڑتا ہے اللہ تعالی ہم سب کو محفوظ رکھے۔"

    const val fifth =   "\n" +"Hadees.No.5\n\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n:" +
            "quote\"رشتہ قطع کرنے والا جنت میں نہ جائے گا“quote\n" +
            "( بخاری و مسلم )\n\n" +

            "آج کل رشتہ داروں اور عزیزوں میں یہ بات عموماً پیش آجاتی ہے کہ ذارسی بات پر ایک دوسرے سے ناراض ہو کر باہمی میل جول ختم کر لیتے ہیں، اور پھر یہ ناراضگی بہت عرصہ تک یا ہمیشہ قائم رہتی ہے ۔ حدیث شریف کو پڑھ کر غور کرنا چاہئے کہ ہم ایک ذراسی ناراضگی پر تعلقات ختم کر کے کس قدر شدید اور خطرناک اقدام کرتے ہیں ، کہ اس پر جنت میں داخلہ بھی نہ ہو سکے اسلئے باہمی تعلقات میں ہر شخص کو دوسرے عزیز قریب کی کسی بات پر ناراضگی سے چھوٹ چھٹا نہیں کرنا چاہئے بلکہ ناراضگی ختم کر کے میل جول رکھنا چاہئے ۔\n"


    const val sixth =   "\n" +"Hadees.No.6\n\n" +

            "حضور اکرم صلى الله عليه وسلم نے فرمایا\n" +

            "quote\"ظلم قیامت کے دن اندھیروں کی شکل میں ہوگا“quote" +
            "\n"+
            "( بخاری و مسلم )\n\n" +
            " ظلم کے لفظی معنی ہیں کسی چیز کو بے محل رکھنا، اس کی صحیح جگہ سے ہٹا کر نا حق موقع پر رکھنا، اسی لئے حق دار کا حق نہ دینا ظلم کہلاتا ہے۔ ہر مومن کی جان و مال اور آبرو کی حفاظت مسلمان کا فریضہ ہے۔ یہ ایک ایسا ضروری حق ہے جو ہر مسلمان دوسرے پر رکھتا ہے۔ اب جو شخص اس حق کو ادا نہیں کرتا وہ ظالم ہے مثلاً کوئی آدمی دوسرے بھائی کو بے عزت کرتا ہے اسے برا بھلا کہتا ہے یا اسکی غیبت کرتا ہے یہ اسکا حق عظمت ضائع کر رہا ہے یہی ظلم ہے اسی طرح کوئی شخص دوسرے آدمی کی زمین ، جائیداد، مکان ، دوکان، نقد مال وزیور پر ناحق قبضہ کرتا ہے تو یہ اسکی ملکیت میں ناحق قبضہ کر کے ظالم بنتا ہے۔ اسی طرح کوئی شخص دوسرے کو ناحق جان سے ماردے یا جسمانی اذیت دے، جس کا وہ مستحق نہیں تھا تو یہ بھی ظلم ہے۔ اس قسم کے تمام ظلم قیامت کی اندھیریاں ہیں ۔ حضرت ابو ہریرہ فرماتے ہیں کہ آنحضرت" +
            "صلى الله عليه وسلم نے فرمایا جس نے اپنے بھائی کی آبرو، یا کسی چیز پر ظلم کیا ہو تو اس کو چاہئے کہ آج ہی اس سے پاک ہو لے اس دن سے پہلے کہ اس کے پاس دینے کو درہم نہ ہوں گے۔ ظلم کا بدلہ دلانے کے لئے ظلم کے برابر مظلوم " +
            "کو ظالم کی نیکیاں دلوائی جائیں گی ۔ اور نیکیاں نہ ہوں گی تو مظلوم کی بدیاں ظالم پر لاد دی جائیں گی"

    const val seventh =   "\n" + "Hadees. No.7\n\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا:\n" +

            "quote\"ٹخنوں کا جو حصہ پائجامہ کے نیچے رہے گا وہ جہنم میں جائے گا " +
            "( بخاری ومسلم )\n\n" +

            "آج کل فیشن کے زور میں یہ برائی ہم میں بہت کثرت سے پھیل گئی ہے کہ اپنے پجامے ، شلوار میں وغیرہ ٹخنوں سے نیچے رکھتے ہیں اور بلا وجہ عذاب مول لیتے ہیں، حالانکہ یہ کوئی مشکل بات نہیں ہے کہ انسان اپنے شلوار ، پائجامہ کو ٹخنے سے اونچا رکھے، ذراسی فکر اور تھوڑے سے اہتمام سے یہ کام ہوسکتا ہے ۔ ایک دوسری روایت میں ٹخنے سے نیچے لباس لٹکانے کو کبر کی علامت بتایا گیا ہے، اور تکبر بھی جہنم میں پہنچانے والا ہے اس لئے اس چیز کی عادت ڈالنی چاہئے کہ کبھی بھی لباس ٹخنے سے نیچے نہ ہو۔\n" +
            "بظاہر یہ بہت معمولی بات معلوم ہوتی ہے، مگر طبعی طور پر اس کا اثر انسان پر بہت گہرا ہوتا ہے، اسلام مسلمان مردوں کو جفاکش اور چست د یکھنا چاہتا ہے ۔ ناز و انداز ، ڈھیلا ڈھالا ہونا، مرد کے لئے کوئی اچھی چیز نہیں اس لئے شریعت نے مردوں کے لئے ریشمی لباس کی ممانعت کی ہے اسی طرح پہننے کے انداز میں بھی وہ طریقہ مقرر کر دیا ہے جس سے لاشعوری اور طبعی طور پر انسان چست رہے، اور مجاہدانہ کارنامے کیلئے ہر وقت چوکس رہے\n" +
            "غیر مسلم اقوام میں بھی چستی و چالا کی کیلئے بوقت ضرورت لباس مختصر کیا گیا ہے چناچہ کھیل کود کے وقت کے لئے نیکرا رائج ہے (اسلام میں یہ گناہ ہے ) ۔ اور عام حالات میں ٹخنے سے نیچے تک کا لباس رائج ہے مگر شریعت اسلامیہ نے اعتدال اور ہمہ وقتی افادیت کے پیش نظر یہ ہیت تجویز کی ہے ۔ جو کسی خاص وقت کے ساتھ خاص نہیں اور حد سے متجاوز بھی نہیں۔ نیز خیال رہے کہ یہ حکم لباس کے سلسلہ میں ہے جیسا کہ ”من الا زار کا لفظ اسکی وضاحت کر رہا ہے۔\n" +
            "لہذا موزے اور جرابیں پہنے سے اگر ٹخنے ڈھک جائیں تو کوئی حرج نہیں ۔"

    const val eight = "\n" + "Hadees.No.8\n\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "quote\"مسلمان تو وہ ہی ہے جس کی زبان اور ہاتھ سے دوسرے مسلمان محفوظ رہیں۔“quote\n" +
            "( بخاری و مسلم )\n\n" +

            "مسلمان تو سرا پا سلامتی ہوتا ہے جس شخص سے لوگوں کو اذیت اور تکلیف پہنچتی ہو ، وہ اس سے خائف رہتے ہوں ، اسکی مثال تو ایک درندے کی سی ہے جو لوگوں کو تکلیف پہنچا تا رہتا ہے اور لوگ اس سے خوفزدہ یا پریشان رہتے ہیں ہمیں اپنی حالت پر نظر ڈالنی چاہے کہ ہماری وجہ سے ہمارے ساتھی رشتہ دار اور پڑوسی اور دیگر میل جول والے، پریشانی یا ناگواری اور تکلیف میں تو مبتلا نہیں ہوتے ، ہمارا کوئی عمل ایسا تو نہیں جو دوسروں کی اذیت اور تشویش کا سبب ہوتا ہو، اگر خدانخواستہ ایسا ہے تو فوراً اپنی اصلاح کیجئے۔ اور ہر اس عمل سے پر ہیز کیجئے جس سے دوسرے مسلمان کو تکلیف ہوتی ہے\n" +
            "البتہ اگر کوئی کام شرعی طور پر صحیح اور ضروری ہے اور اسکی بجا آوری سے کسی کو تشویش یا ناگواری ہوتی ہے تو اس میں گناہ نہیں۔ جیسے کوئی داڑھی رکھ لے اور اس عمل سے کسی کو کوئی تکلیف ہو تو اس کا کوئی اعتبار نہیں یا کسی چور ڈاکوکوشرعی سزادی جائے تو اسکو سزا کی تکلیف تو ہوگی لیکن شرعی حکم کی بجا آوری میں اس تکلیف کا اعتبار نہیں کیونکہ یہ ایک شخص کی تکلیف پورے معاشرے کے سکون وامن کا سبب ہے اور ہر فرد کو ظالموں کی تکلیف دہی سے بچانے کا ذریعہ ہے ۔ دوسرے یہ تکلیف خود اس ظالم کے اپنے غلط طرز عمل کا نتیجہ ہے ۔ اور دوسروں کو تکلیف پہنچانے کی سزا ہے"

    const val nine = "\n" + "Hadees.No.9\n\n" +
            "حضور اکرم صلى الله عليه وسلم نے فرمایا\n" +
            "quote\"جو شخص نرم عادت سے محروم رہاوہ پوری بھلائی سے محروم رہا“quote\n" +
            "(مسلم)\n\n" +

            "بعض آدمی ذرا ذراسی بات پر بھڑک اٹھتے ہیں اور ہر بات میں تشدد، زبردستی اور تند خوئی کا مظاہرہ کرتے رہتے ہیں، ایسا شخص اپنے اس غلط طرز عمل کیوجہ سے بھلائی کا کامل درجہ نہیں حاصل کر سکتا۔ نرمی سے گفتگو کرنا ، ماتحتوں کے ساتھ مشفقانہ سلوک کرنا، بہت سی خوبیوں کا ذریعہ ہوتا ہے۔ کاروبار اور دیگر معاملات میں بھی جو شخص نرم خو ہوتا ہے وہی کامیاب رہتا ہے ، بد مزاجی اور بات بات پر الجھنے والا ، پوری طرح کا میاب نہیں ہوسکتا، اسلئے تند مزاجی سے پر ہیز کرنا چاہئے ۔\n"

    const val tenth = "\n" + "Hadees.No.10\n\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "پہلوان وہ شخص نہیں ہے جو لوگوں کو پچھاڑ دے بلکہ پہلوان وہ شخص ہے جوquote“\n" +
            "quote\"غصہ کے وقت اپنے نفس پر قابور کھے ۔ " +
            "( بخاری ومسلم )\n\n" +

            "انسان اپنے آپ کو دوسروں پر فوقیت دیتا ہے، اور دوسروں کو کمتر اور حقیر سمجھتا ہے، اسی جذبے کا ایک مظاہرہ کشتی سے بھی ہوتا ہے کہ جو اس میں غالب رہے اور سب کو پچھاڑ دے وہ پہلوان سمجھا جاتا ہے، لیکن حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا در حقیقت پہلوان اس شخص کو سمجھا جائے گا جو اپنے نفس پر قابو پالے، کہ جب غصہ آئے حد اعتدال سے باہر نہ نکلے، جو آدمی غصہ آنے پر بے قابو ہو جائے وہ کوئی امتیاز اور فوقیت نہیں رکھتا وہ غصہ کا پچھاڑا ہوا ہے۔\n" +
            "مثلاً ایک شخص غصہ میں مغلوب ہو کر ، اپنی بیوی کو طلاق دے دے یا اپنی چیز میں توڑ ڈالے۔ تو وقتی طور پر اسنے اپنی برتری ظاہر کر دی لیکن نتیجہ کیا نکلا؟ اپنا ہی نقصان تو اس شخص نے وقتی جذ بہ پر قابو نہ پا کر اپنا نقصان کر لیا، اور غصہ میں آکر اپنا گھر برباد کر لیا، یہ پہلوان نہیں ہے ، پہلوان وہی ہے جس نے انجام کو دیکھ کر اپنے جذ بہ پر غلبہ پالیا۔ اور غصہ سے مغلوب نہ ہوا۔ خلاف طبیعت بات پیش آنے پر جب طبیعت میں جھنجھلاہٹ اور اشتعال پیدا ہو تو اس وقت یہ سوچنا چاہئے کہ آخر ہم سے بھی تو کسی کی نافرمانی اور حکم عدولی ہوتی ہے تو ایک مجرم کو دوسرے مجرم پر ناراض ہونے کا کیا حق ہے؟\n" +
            "اور یہ بھی خیال کرنا چاہئے کہ ہر خوشگوار یا\n" +
            "ناگوار بات اللہ تعالیٰ ہی کے حکم سے پیش آتی ہے ، اور وہ ہر حالت ہمارے لئے عین حکمت بھی ہوتی ہے اسلئے کسی ناگواری کے سبب خواہ وہ انسان ہو یا کوئی اور چیز، ناراض ہونے کو کیا فائدہ؟\n"

    const val eleventh = "\n" + "Hadees.No.11\n\n" +
            "حضور اکرم صلى الله عليه وسلم نے فرمایا\n" +
            "quote\"جب تم حیا نہ کرو تو جو چاہو کرو۔quote“\n" +
            "( بخاری و مسلم )\n\n" +

            "یعنی جب حیا ہی نہیں تو سب برائیاں برابر ہیں )\n" +
            "شرم و حیا بھی آدمی کو بہت ساری برائیوں سے بچالیتی ہے جیسے کوئی شخص اپنے والد کے سامنے برائی کرتے ہوے شرماتا ہے یا اپنے استاد کے سامنے جنسی مذاق سے بچتا ہے ، اسی طرح ایک ایمان والے کو اللہ تعالی کے تصور کی بدولت، برائی کرتے ہوئے شرم آیا کرتی ہے ، یہ ایمان کی علامت بھی ہے اور اس کی محافظ بھی اگر حیا نہ رہے تو ایمان رخصت ہو\n" +
            "اسمجھو۔\n" +
            "ایک حدیث شریف میں ہے ” اس میں شک نہیں کہ حیا اور ایمان دونوں ساتھ رہنے والے ہیں جب ان میں سے ایک اٹھا لیا جاتا ہے تو دوسرا بھی چل دیتا ہے (مشکوۃ)۔ ایک اور ارشاد ہے کہ ”حیا ایمان میں سے ہے اور ایمان جنت میں پہنچانے والا ہے\n" +
            "ان ارشادات سے معلوم ہوا کہ ایمان کی حفاظت کا ذریعہ اور اسکی علامت حیا داری ہے، اس جذبہ کی بدولت انسان بہت سی برائیوں سے بچا رہتا ہے اور یہ جذ بہ ختم ہو جائے تو پھر کوئی برائی برائی نظر نہیں آتی ، ایسے شخص کے لئے ہر برائی کر لینا آسان ہے اگر آدمی اللہ تعالیٰ کے احسانات کے دیکھے اور اپنے اعمال پر نظر ڈالے تو اسے اللہ تعالیٰ سے بھی حیاء آنے لگے گی ۔ اسی طرح یہ تصور کرتارہے کہ اللہ تعالیٰ مجھے دیکھ رہے ہیں ، وہ مجھ پر ہر طرح قدرت رکھتے ہیں تو اس سے بھی ایک ایمان والے کو خدا تعالیٰ کی نافرمانی کرنے سے حجاب ہونے لگتا ہے اور اللہ تعالیٰ سے حیا کا حاصل یہ ہے کہ اپنی آنکھ ، کان اور پیٹ وغیرہ کو ان چیزوں سے بچائے جن چیزوں سے اللہ نے روکا ہے۔\n" +
            "نیز یہ بھی یا درکھنا چاہئے کہ نافرمانی کے کاموں میں شرم و حیا کرنی ضروری ہے۔ البتہ جائز کاموں میں اگر ، رواجی اور سماجی جھجک و شرم ہو تو اس کا خیال نہ کرنا چاہئے ۔ جیسے صحابیات رضی اللہ تعالیٰ عنہ حضور اکرم صلى الله عليه وسلم سے دینی مسائل پوچھنے میں کوئی تکلف نہیں کرتی تھیں۔ کیونکہ یہ بات نہ صرف جائز بلکہ ضروری تھی کہ دینی مسائل معلوم کر لئے جائیں اس لئے وہ اس معاملہ طبعی یا رواجی شرم کو آڑے نہیں آنے دیتی تھیں۔\n"

    const val twelve = "\n" +"Hadees.No.12\n\n" +
            "حضور اکرم صلى الله عليه وسلم نے فرمایا\n" +
            "quote\"اللہ کے نزدیک سب عملوں میں وہ عمل زیادہ محبوب ہے جو دائی ہوا گر چہ تھوڑا ہوquote“\n" +
            "( بخاری و مسلم )\n\n" +

            "مسلسل کسی کام کو کرتے رہنا، اسکی لگن اور اس سے تعلق کی نشانی ہے اور ایک دن جوش میں آکر بہت سا کام کر لیا اور پھر غائب یہ جوش و خروش کی علامت ضرور ہے مگرلگن کی کمی بھی اس سے معلوم ہوتی ہے ۔ چونکہ اللہ تعالیٰ کی توجہ انسان کے عمل کی کثرت پر نہیں ہوتی بلکہ وہ اسکی لگن اور جذ بہ اخلاص کو دیکھتے ہیں۔ اسلئے آدمی جب پورے اہتمام کے ساتھ کوئی نفلی کام کرے تو مقدار میں کمی بیشی سے زیادہ اسکی پابندی اور دوام کی فکر رکھے، اور پور سے استقلال سے اس کام کو انجام دیتا رہے، پھر وہ تھوڑا سا عمل جو مسلسل انجام دیا جائے اس جوش و خروش سے کئے جانے والے چند روزہ عمل سے مقدار میں بھی کم نہیں رہتا بلکہ بسا اوقات زیادہ ہو جاتا\n" +
            "ہے۔" +
            "بڑے بڑے کام کر جانے والے لوگ، در حقیقت اس چیز کے پابند تھے کہ ہرا ہم کام مستقل اور دائمی طور\n" +
            "پر کرتے رہنے کی عادت بنا لیتے تھے ، اس حدیث میں اسی زریں اصول کی تلقین فرمائی گئی ہے۔"

    const val thirteen = "\n" +"Hadees.No.13\n\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا:\n" +
            "quote\"اس گھر میں ( رحمت کے ) فرشتے نہیں آتے جس میں کتا یا تصویر ہوں“quote\n" +
            "( بخاری ومسلم )\n\n" +

            "ہمارے زمانہ میں تصویر کی وبا بہت پھیلی ہوئی ہے۔ شائد ہی کوئی گھر اس سے خالی ہو چناچہ رحمت کے فرشتے بھی ان گھروں سے دور رہتے ہیں، اس کے نتیجہ میں بے برکتی ، نا اتفاقی اور عداوتیں پائی جاتی ہیں اللہ تعالیٰ کی رحمت کے امیدوار کو چاہئے کہ وہ اپنا مسکن ان دباؤں سے محفوظ رکھے اور ان سے بچنے کی ہر ممکن کوشش کرے اور شوقیہ ، تصاویر یا تصویروں پر مشتمل سیریاں ، کیلیڈ روغیرہ نہ سجائے اور اسی طرح بلا ضرورت\n" +
            "کتانہ پالے۔"

    const val fourteen = "\n" +"Hadees.No.14\n\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "نبی صلى الله عليه وسلم کا محبوب حمر\n" +
            "quote\"تم میں سے وہ شخص میرے نزدیک زیادہ محبوب ہے جو زیادہ خلیق ہےquote“\n" +
            "( بخاری ومسلم )\n\n" +

            "حضور اکرم صلى الله عليه وسلم کی محبت کتنی بڑی سعادت ہے بڑا خوش نصیب ہے وہ جس کو حضور اکرم کے محبوب رکھیں ، اس عظیم سعادت کو حاصل کر لینا، کوئی مشکل بھی نہیں ہے، اپنے گھروں میں ، اور اپنے کاروبار، ملازمت وغیرہ میں خوش اخلاقی اور شگفتگی کے ساتھ رہے اور لوگوں سے خندہ پیشانی سے ملے جلے انشاء اللہ یہ سعادت حاصل ہو جائے گی۔ البتہ یہ یا درکھنا چاہئے کہ خوش اخلاقی کا یہ مطلب نہیں کہ کسی غلط بات کو محض رواداری\n" +
            "میں صحیح مان لے اور کسی برائی کو منع نہ کرے اور حق و باطل کا فرق ختم کر دے بلکہ ایسے مواقع میں صحیح بات ، اور\n" +
            "درست چیز کا اظہار کر دینا ضروری ہے، یہ خوش اخلاقی کے منافی نہیں ۔"


    const val fifteen  = "\n" +"Hadees.No.15\n\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا:\n" +
            "quote\"دنیا مومن کے لئے قید خانہ اور کافر کیلئے جنت ہے“quote\n" +
            "( بخاری و مسلم )\n\n" +
            "جس شخص کو ہر وقت یہ فکر لگی رہے کہ مجھے اپنے ہر ہر عمل کا جواب دینا ہے، اسے اس جواب دہی کے وقت سے پہلے چین واطمینان ملنا مشکل ہے ہاں جسے یہ فکر نہ ہو وہ ہر طرح آزاد و بے فکر ہے۔ چناچہ مومن اپنے اعمال کے حساب اور انکی جوابدہی کے لئے فکر مند رہتا ہے اور ہر کام کو شریعت کی مقرر کردہ حد میں رہ کر کرنے کا اپنے آپ کو پابند بنا تا ہے، تو ان پابندیوں کی وجہ سے دنیا اس کے لئے ایک ایسے قید خانہ سے کم نہیں جہاں قیدی ہر طرح پابند ہوتا ہے۔" +
            "اور کافر کو آخرت کی کوئی فکر نہیں وہ آزادانہ زندگی بسر کرتا ہے، اور دنیا میں رہتے ہوئے ایسا ہی بے فکر ہے جیسے ایک جنتی جنت میں پہنچ کر مطمئن و بے فکر ہو جائیگا اس کا حاصل یہ ہے کہ مومن کو جو کچھ فکر و پریشانی ہے وہ صرف دنیا ہی میں ہے۔ اس کے بعد اس کیلئے سکون ہی سکون ہے۔ اور کافر کیلئے جو کچھ عیش وعشرت ہے وہ بس دنیا ہی کی حد تک ہے اس کے بعد اپنے کفر کی پاداش میں ہولناک عذاب اس کا مقدر ہے۔ اس لئے یہ دنیا کافر کیلئے جنت اور مومن کیلئے قید خانہ" +
            "ہے۔\n" +
            "بعض علما نے فرمایا کہ مومن کیلئے دنیا کے قید خانہ ہونے کا ایک مطلب" +
            "یہ بھی ہے کہ مومن دنیا سے دل نہیں لگاتا جیسے ایک قیدی جیل خانہ سے دل نہیں لگاتا، اور کافر کیلئے دنیا ایک ایسی جنت ہے جہاں کے رہنے والے اس سے دل لگائے ہوئے ہوں گے۔ اس مطلب سے مومن اور کافر کا جو فرق سامنے آتا ہے اسکی روشنی میں ہم میں سے ہر ایک کو اپنا جائزہ لیکر دیکھنا چاہئے کہ اسے دنیا سے کتنا تعلق ہے۔ ضروریات کی فراہمی کی حد تک؟ یا ہر وقت کی دھن اور پورا دھیان اسی فانی اور حقیر دنیا کا ہے؟" +
            "اسلام نے نہ تو" +
            "رہبانیت کا حکم دیا ہے نہ ہی دنیا طلبی میں دیوانہ ہونے کو پسند کیا ہے۔ اس کی تعلیمات کا نمایاں وصف یہی اعتدال ہے کہ دنیا میں رہو اور ضروریات زندگی کیلئے دوڑ دھوپ کرو۔ لیکن دل کا تعلق اس عارضی سامان سے نہ ہو اور ضروریات زندگی کی فراہمی کو بہانہ بنا کر دینی فرائض سے لا پرواہی اختیار نہ کرو"

    const val sixteen = "\n" +      "Hadees.No.16\n\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا\n" +
            "quote\"مسلمان کے لئے حلال نہیں ہے کہ تین دن سے زیادہ اپنے بھائی سے تعلق قطع رکھے“quote\n" +
            "( بخاری ومسلم )\n" +

            "مومن کے شایان شان نہیں کہ وہ اپنے بھائی سے منہ موڑے، ہاں کبھی وقتی ناراضگی سے بے رخی پیدا ہو سکتی ہے، اسکا مضائقہ نہیں لیکن یہ بے رخی تین دن سے زائد نہیں رہنی چاہئے ۔ تین دن کی مہلت بھی اس لئے ہے کہ طبعی طور پر جو غصہ و آویزش ہو جاتی ہے اسکی مدت تین دن ہی ہے، اس سے زائد بے رخی اور چپقلش رکھی جاتی ہے وہ اپنے آپ گھڑ کر اور تراش تراش کر ہوتی ہے جو ایک مومن کی شان نہیں ۔\n" +
            "چناچہ کبھی اتفاقیہ طور پر کسی سے" +
            "ناراضگی ہو ہی جائے تو بھی تین دن کے بعد سلام و کلام کر لینا چاہئے اور فریقین میں سے جو اس کام میں پہل" +
            "کریگا اسکو زیادہ اجر ملے گا۔"

    const val seventeen =  "\n" + "Hadees.No.17\n\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا:\n" +
            " quote\"انسان کو ایک ہی سوراخ سے دو مرتبہ نہیں ڈسا جاسکتا“quote \n" +
            "( بخاری و مسلم )\n\n" +

            "انسان ایک دفعہ تو نا دانستگی میں دھو کہ کھا جاتا ہے۔ لیکن دوبارہ اس کو دھو کہ نہیں دیا جاسکتا۔ حضرت مفتی\n" +
            "صاحب قدس سرہ نے اس حدیث کی تشریح میں تحریر فرمایا ہے کہ :\n" +
            "دوبارہ اس کے پاس نہیں جانتا\n" +
            "و یعنی جس سے ایک مرتبہ نقصان پہنچا ہے" +
            "اس تشریح سے یہ بھی سمجھ میں آتا ہے کہ مومن کو اگر کسی کی صحبت سے دین کا نقصان ہو جائے یا کسی معاملہ اور کام سے دینی نقصان ہو جائے تو وہ پھر دوبارہ اس کے قریب نہیں پھٹکتا۔ لہذا جب کوئی شخص اپنی سابقہ زندگی کی غفلت اور غلط کاری سے توبہ کرلے تو اسے چاہے کہ پھر دوبارہ ان پرانی دوستیوں اور غیر ضروری تعلقات کو ختم کر دے، اور جس چیز سے ایک دفعہ نقصان اٹھا چکا ہے اس میں دوبارہ مبتلا نہ ہو۔"

    const val eighteen =  "\n" + "Hadees.No.18\n\n" +
            "حضور اکرم صلى الله عليه وسلم نے فرمایا:\n" +
            "quoteحقیقی غنا دل کا غنا ہوتا ہےquote“\n" +
            "( بخاری ومسلم )\n\n" +

            "زیادہ مال و دولت کا جمع ہو جانا تو نگری نہیں، بلکہ انسان کے دل میں فراخی ہو حقیقی مالداری یہی ہے۔ مال و دولت جمع کرتے رہنے سے دل کو اطمینان نہیں ہوا کرتا ۔ بلکہ جو کچھ میسر ہے اس پر راضی ہو جانے سے اور قناعت اختیار کرنے سے سکون ملتا ہے، جو شخص مال دولت ، زمین جائیداد جمع کرنے میں ہی لگا رہے یہ تو در حقیقت فقیر ہے کہ بہت کچھ حاصل ہونے پر بھی مزید دوسری چیز کا طلبگار ہے ، اسی لئے حضور اکرم صلى الله عليه وسلم نے فرمایا کہ مالداری در حقیقت دل کی بے نیازی کا نام ہے۔"

    const val nineteen =  "\n" + "Hadees.No.19\n\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا:\n" +
            "quote“دنیا میں ایسے رہو جیسے کوئی مسافر یا رہگز رہتا ہےquote“\n" +
            "( بخاری ومسلم )\n\n" +


            "ایک آدمی اپنے گھر سے جب کسی کام کے لئے دوسرے شہر کا سفر کرتا ہے تو وہاں جا کر اپنے شہر نے ، کھانے پینے کا انتظام کرتا ہے لیکن اپنے اس عارضی قیام کیلئے بس ضرورت کی چیزیں پیش نظر رکھتا ہے زیادہ ساز و سامان کی فکر میں نہیں پڑتا نہ ہی اپنی عارضی رہائش گاہ کی سجاوٹ و بناوٹ کیطرف دھیان دیتا ہے کھانے پینے میں بھی ذائقہ کی طرف زیادہ توجہ نہیں دیتا ، ہاں بغیر کسی اہتمام کے اگر اچھا مکان اچھا کھانا وغیرہ مل جائے تو بہر حال استعمال کر لیتا ہے۔ لیکن اپنی تمام توجہ اپنے ضروری کام کی طرف رکھتا ہے جس کیلئے اس نے اپنا گھر چھوڑا ، اور سفر کی مشقت برداشت کی اور ان معاملات میں اس سے بھی زیادہ لا پرواہ وہ شخص ہوتا ہے جو دوران سفر ذرا دیر کو ستانے کیلئے کہیں رک گیا ہو، جیسے ریل گاڑی میں سفر کرتے ہوئے کسی اسٹیشن پر اتر کر کوئی شخص اپنی تھکن اتارنے لگے یا چائے وغیرہ پینے لگے تو اس کی تو ساری ہی توجہ اپنی گاڑی کی طرف ہوگی ۔ اپنی چائے پی کر دوبارہ ریل گاڑی میں سوار ہو جائے گا۔\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا کہ دنیا میں تم ایسے ہی رہو جیسے کوئی مسافر پر دیں جا کر رہتا ہے، وہ وہاں کی چیزوں سے دل نہیں لگاتا اور ضرورت کی حد تک کام چلاتا ہے، اور اپنے مقصد میں منہمک رہتا ہے، بلکہ اس سے بھی زیادہ اچھی بات یہ ہے کہ تم دنیا میں ایسے رہو جیسے کوئی راہ گذرذرا ذرا دیر کیلئے کہیں ٹھرتا ہے تو اسکی ساری توجہ بس اپنے سفر کی طرف ہوتی ہے تو تم بھی دنیا کی چیزیں بقدر ضرورت جمع کر لو ، مگر اپنے دل ان سے نہ لگا دیا اس سے بڑھ کر یہ کہ کچھ بھی فکر دنیا کے ساز وسامان کی نہ کرو، بس اپنے سفر کی طرف دھیان رکھو کہ ہر آنے والا دن تمہیں اپنے اصلی گھر جنت کی طرف\n" +
            "قریب کر رہا ہے۔"

    const val twenty =  "\n" + "Hadees.No.20\n\n"  +
            "حضور اکرم صلى الله عليه وسلم نے فرمایا:\n" +
            "انسان کے جھوٹا ہونے کیلئے اتنا ہی کافی ہے کہ جو بات سنے (بغیر تحقیق کے ) لوگوں“quote\n" +
            "quote\"سے بیان کرنا شروع کر دے " +
            "( بخاری ومسلم )\n\n" +

            "جان بوجھ کر واقعہ کے خلاف بیان کرنا تو جھوٹ ہے ہی، کسی بات کو بغیر تحقیق کے دوسروں کے سامنے بیان کر دینا بھی جھوٹا بنا دینے کے مترادف ہے، عام طور پر افواہوں سے جو کچھ نقصان د تباہی ہوتی ہے وہ سب کے سامنے ہے بلخصوص کسی اختلاف ولڑائی کے وقت بلا تحقیق باتیں، معاملہ کو کہیں سے کہیں پہنچادیتی ہیں ۔ ایک جماعت اور علاقہ کے لوگ بغیر تحقیق کئے دوسرے فریق کے خلاف سنی سنائی باتیں دوسروں تک پہنچا کر اختلاف کو ہوا دیتے ہیں ۔اس حدیث کو سامنے رکھ کر ہمیں اپنے عمل کو جانچنا چاہئے کہ ہم افواہوں کے پھیلانے میں شریک تو نہیں؟ ایسا شخص جھوتا ہے، چنانچہ نہ تو افواہوں کو پھیلا و نہ کسی دوسرے سے سن کر ان پر یقین کرو۔ اسی طرح کسی حدیث\n" +
            "یا آیت قرآنیہ کا حوالہ، یا اس کا مطلب پوری تحقیق کئے بغیر بیان نہیں کرنا چاہئے ،تقریر کرتے ہوئے اور مضمون لکھتے ہوئے بھی اس بات کا خاص اہتمام کرنا ضروری ہے کہ کوئی بات بے تحقیق بیان نہ ہو ورنہ بیان کرنے والے کو جھوٹا ہی قرار دیا جائے گا۔ ایک دوسری حدیث شریف میں بلا تحقیق حدیث بیان کرنے کی بہت سختی سے ممانعت وارد ہے اور ایسے شخص کیلئے سخت سزا کا حکم ہے، جو بلا تحقیق روایت حدیث کرتا ہے۔"

    const val twentyOne =  "\n" +  "Hadees.No.21\n\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا:\n" +
            "quote\"آدمی کا چاچا اس کے باپ کی مانند ہے“quote\n" +
            "( بخاری و مسلم)\n\n" +

            "چناچہ باپ کے احترام ہی کی طرح اپنے چا، تایا کا احترام کرنا چاہئے اور اپنے معاملات میں بلخصوص خانگی مسائل میں انکے مشورے کو اہمیت دینی چاہئے بلخصوص جبکہ باپ موجود نہ ہوں ۔ اس حدیث میں اپنے بڑوں کے ادب و احترام کی تعلیم دی گئی ہے کہ جو بھی آدمی ہم سے عمر میں یا رشتہ میں بڑا ہو اس کا ادب کریں۔ اپنے والد کا ادب و احترام تو ایک فطری سی بات ہے، اور شریعت میں ان کی عظمت و احترام کو بجالانے کی بھی سختی سے تاکید ہے، مگر اس کے ساتھ ساتھ ماں باپ کے دیگر رشتہ داروں کا بھی ادب کرنا ضروری قرار دیا گیا ہے۔ ہماری شامت اعمال ہے کہ اب ہم اپنے والدین کا ہی شایان شان احترام نہیں کرتے ، بلکہ بعض بد نصیب تو اپنے والدین سے باقاعدہ بد تمیزی پر اتر آتے ہیں، اور انہیں ایذا پہنچانے سے بھی باز نہیں آتے ،مگر خوب یا درکھنا چاہئے کہ اپنے ماں باپ کی عظمت و خدمت کے بغیر دنیا میں کبھی بھی عزت و فراخی حاصل نہیں ہو سکتی ماں باپ اللہ تعالیٰ کی صفت ربوبیت کا مظہر اور اس کا ذریعہ بنائے گئے ہیں ، جو شخص اس کا احترام ولحاظ نہیں کرتا وہ اس ربوبیت کی ناشکری اور ناقدری کا مرتکب ہوتا ہے، یہی وجہ ہے کہ وہ دنیاوی اعتبار سے بھی نہیں پنپتا ، اور اس حکم عدولی کی بدولت قیامت میں جو کچھ پیش آئے گا اس سے تو کوئی جائے فرار ہے ہی نہیں ۔ اس لئے والدین کا دلی احترام اور انکی خدمت بلخصوص جبکہ وہ اپنے ضعف کی وجہ سے اس کے محتاج ہوں ضرور کرنی چاہئے ۔ یہی نہیں بلکہ رسول صلى الله عليه وسلم کا ارشاد ہے کہ اپنے چا تایا کو بھی باپ کے درجہ میں سمجھ کر ان سے و ہی عظمت و احترام کا معاملہ کرنا چاہئے جو اپنے والدین سے ہوتا ہے اسی طرح اگر وہ ضرورتمند یا مفلس و نادار ہوں تو بقدر وسعت ان کی امداد کرنی اور خبر گیری رکھنا چاہئے ۔"

    const val twentyTwo =  "\n" + "Hadees.No.22\n\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا:\n" +
            "quote\"جو شخص کسی مسلمان کے عیب کو چھپائیگا اللہ تعالیٰ قیامت کو اس کے عیب چھپائیگا“quote \n" +
            "( بخاری و مسلم )\n" +


            "اپنی بڑائی کے اظہار کیلئے کبھی ایسا بھی ہوتا ہے کہ آدمی دوسروں کے عیوب کی تشہیر کرتا ہے، تا کہ لوگوں کے دلوں میں انکی حقارت پیدا ہو جائے ، یہ جذبہ بھی مومن کے شایان شان نہیں کوئی انسان بھی برائی اور عیب سے خالی نہیں ہوتا ، اسلئے دوسروں کے عیوب پر پردہ ڈال دینا ، ہی مناسب ہے، اس حدیث شریف میں اسی کی بشارت ہے کہ ایسے شخص کے عیوب پر اللہ تعالیٰ قیامت کے دن پردہ ڈال دیں گے جو دنیا میں اپنے مسلمان بھائیوں کے عیوب کی پردہ پوشی کرتا رہا۔"

    const val twentyThree =  "\n" + "Hadees.No.23\n\n" +
            "حضور اکرم صلى الله عليه وسلم نے ارشاد فرمایا:\n" +
            "وہ شخص کامیاب ہے جو اسلام لا یا اور جس کو بقدر کفایت رزق مل گیا اور اللہ“quote\n" +
            "quote\"تعالیٰ نے اس کو اپنے رزق پر قناعت دیدی " +
            "( بخاری ومسلم )\n\n" +

            "دنیا میں انسان حق تعالیٰ کی فرماں برداری کیلئے آیا ہے، اور یہاں زندگی گذارنے کے لئے اسے ضروریات زندگی کی حاجت ہے اور اطمینان وسکون کی ضرورت ہے۔ تو ایسا شخص جسے اسلام کی دولت میسر آگئی کہ اس کی پوری زندگی اسلام کے تقاضوں کے مطابق ہے، اور زندگی گذارنے کے لئے کفایت کرنے والا سامان زندگی مل گیا، اور اس پر قناعت و اطمینان مل گیا، واقعی یہ شخص کامیاب ہے اور خوش قسمت ہے ۔ اسلام سے محرومی تو محرومی ہے ہی زیادہ مال و دولت بھی کچھ اچھے نتائج پیدا نہیں کرتا ، اور قناعت سے محرومی یعنی حرص و ہوس ایسی بلا ہے کہ اس میں گرفتار ہونے والا کبھی اور کسی طرح بھی مطمئن و خوش و خرم نہیں دیکھا گیا۔ اس لئے ہر مسلمان کو اپنے اسلام کو کامل بنانے کی فکر میں رہنا چاہئے اور بقدر ضرورت رزق حاصل کرنے کی کوشش کر لینی چاہیئے اور جو شخص جس کو یہ تین نعمتیں میسر ہوں وہ دنیا میں کامیاب شخص ہے اس پر شکر بجا لانا چاہئے کامیابی کے غلط معیاروں نے ہم میں بہت سے مسلمانوں کو اسلام جیسی نعمت اور بقدر ضرورت حلال رزق حاصل ہونے کے باوجود خود کومحروم سمجھنے اور ہر وقت شکایت کرنے والا بنا رکھا ہے اللہ تعالیٰ ہم سب کو صحیح فہم اور عقل سلیم عطا فرمائیں ( آمین )"


}